summer20100514/NRF52_Make_Progress/main.c
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_lesc_request_handler();
    APP_ERROR_CHECK(err_code);

    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

static void EPD_Display_Test(void)
{
    UWORD Imagesize = ((EPD_WIDTH % 8 == 0)? (EPD_WIDTH / 8 ): (EPD_WIDTH / 8 + 1)) * EPD_HEIGHT;
    UBYTE ImageCache[Imagesize];

    #if 0
    if(EPD_Init(lut_full_update) != 0) {
        NRF_LOG_RAW_INFO("e-Paper init failed\r\n");
    }
    EPD_Clear();
    DEV_Delay_ms(400);

    // NRF_LOG_RAW_INFO("Paint_NewImage\r\n");
    Paint_NewImage(ImageCache, EPD_WIDTH, EPD_HEIGHT, 270, WHITE);
    /*show image for array*/
    NRF_LOG_RAW_INFO("show image for array\r\n");
    Paint_SelectImage(ImageCache);
    Paint_Clear(WHITE);

    Paint_DrawBitMap(gImage_2in9);
    EPD_Display(ImageCache);
    DEV_Delay_ms(400);
#endif

#if 0
    if(EPD_Init(lut_full_update) != 0) {
        NRF_LOG_RAW_INFO("e-Paper init failed\r\n");
    }
    EPD_Clear();
    DEV_Delay_ms(400);

    // NRF_LOG_RAW_INFO("Paint_NewImage\r\n");
    Paint_NewImage(ImageCache, EPD_WIDTH, EPD_HEIGHT, 270, WHITE);
    // Drawing on the image
    //1.Select Image
    NRF_LOG_RAW_INFO("SelectImage:ImageCache\r\n");
    Paint_SelectImage(ImageCache);
    Paint_Clear(WHITE);

    // 2.Drawing on the image
    NRF_LOG_RAW_INFO("Drawing:ImageCache\r\n");
    Paint_DrawPoint(10, 80, BLACK, DOT_PIXEL_1X1, DOT_STYLE_DFT);
    Paint_DrawPoint(10, 90, BLACK, DOT_PIXEL_2X2, DOT_STYLE_DFT);
    Paint_DrawPoint(10, 100, BLACK, DOT_PIXEL_3X3, DOT_STYLE_DFT);
    Paint_DrawLine(20, 70, 70, 120, BLACK, LINE_STYLE_SOLID, DOT_PIXEL_1X1);
    Paint_DrawLine(70, 70, 20, 120, BLACK, LINE_STYLE_SOLID, DOT_PIXEL_1X1);    
    Paint_DrawRectangle(20, 70, 70, 120, BLACK, DRAW_FILL_EMPTY, DOT_PIXEL_1X1);
    Paint_DrawRectangle(80, 70, 130, 120, BLACK, DRAW_FILL_FULL, DOT_PIXEL_1X1);
    Paint_DrawCircle(45, 95, 20, BLACK, DRAW_FILL_EMPTY, DOT_PIXEL_1X1);
    Paint_DrawCircle(105, 95, 20, WHITE, DRAW_FILL_FULL, DOT_PIXEL_1X1);
    Paint_DrawLine(85, 95, 125, 95, BLACK, LINE_STYLE_DOTTED, DOT_PIXEL_1X1);
    Paint_DrawLine(105, 75, 105, 115, BLACK, LINE_STYLE_DOTTED, DOT_PIXEL_1X1);
    Paint_DrawString_EN(10, 0, "waveshare", &Font16, BLACK, WHITE);
    Paint_DrawString_EN(10, 20, "hello world", &Font12, WHITE, BLACK);
    Paint_DrawNum(10, 33, 123456789, &Font12, BLACK, WHITE);
    Paint_DrawNum(10, 50, 987654321, &Font16, WHITE, BLACK);
    Paint_DrawString_CN(130, 0, "ÄãºÃ", &Font12CN, BLACK, WHITE);
    Paint_DrawString_CN(130, 20,"Î¢Èí", &Font24CN, WHITE, BLACK);

    NRF_LOG_RAW_INFO("EPD_Display\r\n");
    EPD_Display(ImageCache);
    DEV_Delay_ms(400);
#endif

#if 0
    //Partial refresh, example shows time    
    if(EPD_Init(lut_partial_update) != 0) {
        NRF_LOG_RAW_INFO("e-Paper init failed\r\n");
    }
    EPD_Clear();
    DEV_Delay_ms(400);

    // NRF_LOG_RAW_INFO("Paint_NewImage\r\n");
    Paint_NewImage(ImageCache, EPD_WIDTH, EPD_HEIGHT, 270, WHITE);
    Paint_SelectImage(ImageCache);
    Paint_Clear(WHITE);

    Paint_DrawRectangle(0, 0, 120, 40, BLACK, DRAW_FILL_FULL, DOT_PIXEL_1X1);
    PAINT_TIME sPaint_time;
    sPaint_time.Hour = 12;
    sPaint_time.Min = 34;
    sPaint_time.Sec = 56;
    for (;;) {
        sPaint_time.Sec = sPaint_time.Sec + 1;
        if (sPaint_time.Sec == 60) {
            sPaint_time.Min = sPaint_time.Min + 1;
            sPaint_time.Sec = 0;
            if (sPaint_time.Min == 60) {
                sPaint_time.Hour =  sPaint_time.Hour + 1;
                sPaint_time.Min = 0;
                if (sPaint_time.Hour == 24) {
                    sPaint_time.Hour = 0;
                    sPaint_time.Min = 0;
                    sPaint_time.Sec = 0;
                }
            }
        }
        Paint_ClearWindows(15, 65, 15 + Font20.Width * 7, 65 + Font20.Height, WHITE);
        Paint_DrawTime(15, 65, &sPaint_time, &Font20, WHITE, BLACK);

	EPD_Display(ImageCache);
        DEV_Delay_ms(500);//Analog clock 1s
    }
#endif
}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
    int key_value, rotary_state;
    // Create a new image cache
    UWORD Imagesize = ((EPD_WIDTH % 8 == 0)? (EPD_WIDTH / 8 ): (EPD_WIDTH / 8 + 1)) * EPD_HEIGHT;
    UBYTE ImageCache[Imagesize];

    // Initialize.
    log_init();
    timers_init();
    // buttons_leds_init(&erase_bonds);
    rotary_encoder_init();
    spi_and_gpio_init();

    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("compiled at %s %s", __DATE__, __TIME__);
    application_timers_start();
    advertising_start(erase_bonds);
    // EPD_Display_Test();

    //Partial refresh, example shows time    
    if(EPD_Init(lut_partial_update) != 0) {
        NRF_LOG_RAW_INFO("e-Paper init failed\r\n");
    }
    EPD_Clear();
    DEV_Delay_ms(400);
    // NRF_LOG_RAW_INFO("Paint_NewImage\r\n");
    Paint_NewImage(ImageCache, EPD_WIDTH, EPD_HEIGHT, 270, WHITE);
    Paint_SelectImage(ImageCache);
    Paint_Clear(WHITE);

    Paint_DrawCircle(30, 75, 14, BLACK, DRAW_FILL_FULL, DOT_PIXEL_1X1);
    Paint_DrawCircle(266, 75, 14, BLACK, DRAW_FILL_FULL, DOT_PIXEL_1X1);
    Paint_DrawRectangle(30, 60, 266, 90, BLACK, DRAW_FILL_FULL, DOT_PIXEL_1X1);
    PAINT_TIME sPaint_time;
    sPaint_time.Hour = 12;
    sPaint_time.Min = 34;
    sPaint_time.Sec = 56;

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();

        key_value = get_key_value();
        rotary_state = get_rotary_encoder_state();
        if (key_value != KEY_UNPRESSED) {
            NRF_LOG_RAW_INFO("key: %d\r\n", key_value);
        }

        if (rotary_state != ROTARY_STATE_INVALID) {
            NRF_LOG_RAW_INFO("rotary: %d\r\n", rotary_state);
        }

        sPaint_time.Sec = sPaint_time.Sec + 1;
        if (sPaint_time.Sec == 60) {
            sPaint_time.Min = sPaint_time.Min + 1;
            sPaint_time.Sec = 0;
            if (sPaint_time.Min == 60) {
                sPaint_time.Hour =  sPaint_time.Hour + 1;
                sPaint_time.Min = 0;
                if (sPaint_time.Hour == 24) {
                    sPaint_time.Hour = 0;
                    sPaint_time.Min = 0;
                    sPaint_time.Sec = 0;
                }
            }
        }
        Paint_ClearWindows(100, 25, 100 + Font20.Width * 7, 25 + Font20.Height, WHITE);
        Paint_DrawTime(100, 25, &sPaint_time, &Font20, WHITE, BLACK);
	EPD_Display(ImageCache);
    }
}


